; domain
( define ( domain Blocks4 )
  ( :requirements :strips :typing :equality :htn )
  ( :types block )

  ( :predicates
    ( on-table ?b - block )
    ( on ?b1 - block ?b2 - block )
    ( clear ?b - block )
    ( hand-empty )
    ( holding ?b - block )
  )

  ( :action !Pickup
    :parameters
    (
      ?b - block
    )
    :precondition
    ( and
      ( on-table ?b )
      ( clear ?b )
      ( hand-empty )
    )
    :effect
    ( and
      ( not ( on-table ?b ) )
      ( not ( clear ?b ) )
      ( not ( hand-empty ) )
      ( holding ?b )
    )
  )

  ( :action !Putdown
    :parameters
    (
      ?b - block
    )
    :precondition
    ( and
      ( holding ?b )
    )
    :effect
    ( and
      ( not ( holding ?b ) )
      ( hand-empty )
      ( on-table ?b )
      ( clear ?b )
    )
  )

  ( :action !Unstack
    :parameters
    (
      ?b1 - block
      ?b2 - block
    )
    :precondition
    ( and
      ( on ?b1 ?b2 )
      ( clear ?b1 )
      ( hand-empty )
    )
    :effect
    ( and
      ( not ( on ?b1 ?b2 ) )
      ( not ( clear ?b1 ) )
      ( not ( hand-empty ) )
      ( clear ?b2 )
      ( holding ?b1 )
    )
  )

  ( :action !Stack
    :parameters
    (
      ?b1 - block
      ?b2 - block
    )
    :precondition
    ( and
      ( holding ?b1 )
      ( clear ?b2 )
    )
    :effect
    ( and
      ( not ( holding ?b1 ) )
      ( not ( clear ?b2 ) )
      ( hand-empty )
      ( on ?b1 ?b2 )
      ( clear ?b1 )
    )
  )

)

; problem
( define ( problem probname )
  ( :domain blocks4 )
  ( :requirements :strips :typing :equality )
  ( :objects
    b000 - block
    b001 - block
    b002 - block
    b003 - block
  )
  ( :init
    ( on-table b000 )
    ( on b001 b000 )
    ( on b002 b001 )
    ( on b003 b002 )
    ( clear b003 )
    ( hand-empty)
  )
  ( :goal
    ( and
      ( clear b000 )
    )
  )
)

; plan
1. (!unstack b003 b002)
   deleted: (on b003 b002) (clear b003) (hand-empty)
   added: (clear b002) (holding b003)
   goals met: 0 of 1
2. (!putdown b003)
   deleted: (holding b003)
   added: (hand-empty) (on-table b003) (clear b003)
   goals met: 0 of 1
3. (!unstack b002 b001)
   deleted: (on b002 b001) (clear b002) (hand-empty)
   added: (clear b001) (holding b002)
   goals met: 0 of 1
4. (!putdown b002)
   deleted: (holding b002)
   added: (hand-empty) (on-table b002) (clear b002)
   goals met: 0 of 1
5. (!unstack b001 b000)
   deleted: (on b001 b000) (clear b001) (hand-empty)
   added: (clear b000) (holding b001)
   goals met: 1 of 1
